OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f97j94.h
extern __at(0x0E2A) __sfr RPINR0_1;

typedef union
  {
  struct
    {
    unsigned U1RXR0             : 1;
    unsigned U1RXR1             : 1;
    unsigned U1RXR2             : 1;
    unsigned U1RXR3             : 1;
    unsigned U1TXR0             : 1;
    unsigned U1TXR1             : 1;
    unsigned U1TXR2             : 1;
    unsigned U1TXR3             : 1;
    };

  struct
    {
    unsigned U1RXR              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned U1TXR              : 4;
    };
  } __RPINR0_1bits_t;

extern __at(0x0E2A) volatile __RPINR0_1bits_t RPINR0_1bits;

#define _U1RXR0                 0x01
#define _U1RXR1                 0x02
#define _U1RXR2                 0x04
#define _U1RXR3                 0x08
#define _U1TXR0                 0x10
#define _U1TXR1                 0x20
#define _U1TXR2                 0x40
#define _U1TXR3                 0x80

//==============================================================================


//==============================================================================
//        RPINR2_3 Bits

extern __at(0x0E2B) __sfr RPINR2_3;

typedef union
  {
  struct
    {
    unsigned U2RXR0             : 1;
    unsigned U2RXR1             : 1;
    unsigned U2RXR2             : 1;
    unsigned U2RXR3             : 1;
    unsigned U2TXR0             : 1;
    unsigned U2TXR1             : 1;
    unsigned U2TXR2             : 1;
    unsigned U2TXR3             : 1;
    };

  struct
    {
    unsigned U2RXR              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned U2TXR              : 4;
    };
  } __RPINR2_3bits_t;

extern __at(0x0E2B) volatile __RPINR2_3bits_t RPINR2_3bits;

#define _U2RXR0                 0x01
#define _U2RXR1                 0x02
#define _U2RXR2                 0x04
#define _U2RXR3                 0x08
#define _U2TXR0                 0x10
#define _U2TXR1                 0x20
#define _U2TXR2                 0x40
#define _U2TXR3                 0x80

//==============================================================================


//==============================================================================
//        RPINR4_5 Bits

extern __at(0x0E2C) __sfr RPINR4_5;

typedef union
  {
  struct
    {
    unsigned U3RXR0             : 1;
    unsigned U3RXR1             : 1;
    unsigned U3RXR2             : 1;
    unsigned U3RXR3             : 1;
    unsigned U3TXR0             : 1;
    unsigned U3TXR1             : 1;
    unsigned U3TXR2             : 1;
    unsigned U3TXR3             : 1;
    };

  struct
    {
    unsigned U3RXR              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned U3TXR              : 4;
    };
  } __RPINR4_5bits_t;

extern __at(0x0E2C) volatile __RPINR4_5bits_t RPINR4_5bits;

#define _U3RXR0                 0x01
#define _U3RXR1                 0x02
#define _U3RXR2                 0x04
#define _U3RXR3                 0x08
#define _U3TXR0                 0x10
#define _U3TXR1                 0x20
#define _U3TXR2                 0x40
#define _U3TXR3                 0x80

//==============================================================================


//==============================================================================
//        RPINR6_7 Bits

extern __at(0x0E2D) __sfr RPINR6_7;

typedef union
  {
  struct
    {
    unsigned U4RXR0             : 1;
    unsigned U4RXR1             : 1;
    unsigned U4RXR2             : 1;
    unsigned U4RXR3             : 1;
    unsigned U4TXR0             : 1;
    unsigned U4TXR1             : 1;
    unsigned U4TXR2             : 1;
    unsigned U4TXR3             : 1;
    };

  struct
    {
    unsigned U4RXR              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned U4TXR              : 4;
    };
  } __RPINR6_7bits_t;

extern __at(0x0E2D) volatile __RPINR6_7bits_t RPINR6_7bits;

#define _U4RXR0                 0x01
#define _U4RXR1                 0x02
#define _U4RXR2                 0x04
#define _U4RXR3                 0x08
#define _U4TXR0                 0x10
#define _U4TXR1                 0x20
#define _U4TXR2                 0x40
#define _U4TXR3                 0x80

//==============================================================================


//==============================================================================
//        RPINR8_9 Bits

extern __at(0x0E2E) __sfr RPINR8_9;

typedef union
  {
  struct
    {
    unsigned SCK1R0             : 1;
    unsigned SCK1R1             : 1;
    unsigned SCK1R2             : 1;
    unsigned SCK1R3             : 1;
    unsigned SDI1R0             : 1;
    unsigned SDI1R1             : 1;
    unsigned SDI1R2             : 1;
    unsigned SDI1R3             : 1;
    };

  struct
    {
    unsigned SCK1R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned SDI1R              : 4;
    };
  } __RPINR8_9bits_t;

extern __at(0x0E2E) volatile __RPINR8_9bits_t RPINR8_9bits;

#define _SCK1R0                 0x01
#define _SCK1R1                 0x02
#define _SCK1R2                 0x04
#define _SCK1R3                 0x08
#define _SDI1R0                 0x10
#define _SDI1R1                 0x20
#define _SDI1R2                 0x40
#define _SDI1R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR10_11 Bits

extern __at(0x0E2F) __sfr RPINR10_11;

typedef union
  {
  struct
    {
    unsigned SS1R0              : 1;
    unsigned SS1R1              : 1;
    unsigned SS1R2              : 1;
    unsigned SS1R3              : 1;
    unsigned SCK2R0             : 1;
    unsigned SCK2R1             : 1;
    unsigned SCK2R2             : 1;
    unsigned SCK2R3             : 1;
    };

  struct
    {
    unsigned SS1R               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned SCK2R              : 4;
    };
  } __RPINR10_11bits_t;

extern __at(0x0E2F) volatile __RPINR10_11bits_t RPINR10_11bits;

#define _SS1R0                  0x01
#define _SS1R1                  0x02
#define _SS1R2                  0x04
#define _SS1R3                  0x08
#define _SCK2R0                 0x10
#define _SCK2R1                 0x20
#define _SCK2R2                 0x40
#define _SCK2R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR12_13 Bits

