OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f97j94.h
extern __at(0x0EE7) volatile __PORTKbits_t PORTKbits;

#define _RK0                    0x01
#define _RK1                    0x02
#define _RK2                    0x04
#define _RK3                    0x08
#define _RK4                    0x10
#define _RK5                    0x20
#define _RK6                    0x40
#define _RK7                    0x80

//==============================================================================


//==============================================================================
//        LATK Bits

extern __at(0x0EE8) __sfr LATK;

typedef struct
  {
  unsigned LATK0                : 1;
  unsigned LATK1                : 1;
  unsigned LATK2                : 1;
  unsigned LATK3                : 1;
  unsigned LATK4                : 1;
  unsigned LATK5                : 1;
  unsigned LATK6                : 1;
  unsigned LATK7                : 1;
  } __LATKbits_t;

extern __at(0x0EE8) volatile __LATKbits_t LATKbits;

#define _LATK0                  0x01
#define _LATK1                  0x02
#define _LATK2                  0x04
#define _LATK3                  0x08
#define _LATK4                  0x10
#define _LATK5                  0x20
#define _LATK6                  0x40
#define _LATK7                  0x80

//==============================================================================


//==============================================================================
//        TRISK Bits

extern __at(0x0EE9) __sfr TRISK;

typedef struct
  {
  unsigned TRISK0               : 1;
  unsigned TRISK1               : 1;
  unsigned TRISK2               : 1;
  unsigned TRISK3               : 1;
  unsigned TRISK4               : 1;
  unsigned TRISK5               : 1;
  unsigned TRISK6               : 1;
  unsigned TRISK7               : 1;
  } __TRISKbits_t;

extern __at(0x0EE9) volatile __TRISKbits_t TRISKbits;

#define _TRISK0                 0x01
#define _TRISK1                 0x02
#define _TRISK2                 0x04
#define _TRISK3                 0x08
#define _TRISK4                 0x10
#define _TRISK5                 0x20
#define _TRISK6                 0x40
#define _TRISK7                 0x80

//==============================================================================


//==============================================================================
//        ODCON2 Bits

extern __at(0x0EEA) __sfr ODCON2;

typedef struct
  {
  unsigned ECCP3OD              : 1;
  unsigned CCP4OD               : 1;
  unsigned CCP5OD               : 1;
  unsigned CCP6OD               : 1;
  unsigned CCP7OD               : 1;
  unsigned CCP8OD               : 1;
  unsigned CCP9OD               : 1;
  unsigned CCP10OD              : 1;
  } __ODCON2bits_t;

extern __at(0x0EEA) volatile __ODCON2bits_t ODCON2bits;

#define _ECCP3OD                0x01
#define _CCP4OD                 0x02
#define _CCP5OD                 0x04
#define _CCP6OD                 0x08
#define _CCP7OD                 0x10
#define _CCP8OD                 0x20
#define _CCP9OD                 0x40
#define _CCP10OD                0x80

//==============================================================================


//==============================================================================
//        ODCON1 Bits

extern __at(0x0EEB) __sfr ODCON1;

typedef struct
  {
  unsigned SSP1OD               : 1;
  unsigned SSP2OD               : 1;
  unsigned USART1OD             : 1;
  unsigned USART2OD             : 1;
  unsigned USART3OD             : 1;
  unsigned USART4OD             : 1;
  unsigned ECCP1OD              : 1;
  unsigned ECCP2OD              : 1;
  } __ODCON1bits_t;

extern __at(0x0EEB) volatile __ODCON1bits_t ODCON1bits;

#define _SSP1OD                 0x01
#define _SSP2OD                 0x02
#define _USART1OD               0x04
#define _USART2OD               0x08
#define _USART3OD               0x10
#define _USART4OD               0x20
#define _ECCP1OD                0x40
#define _ECCP2OD                0x80

//==============================================================================


//==============================================================================
//        MDCARL Bits

extern __at(0x0EEC) __sfr MDCARL;

typedef union
  {
  struct
    {
    unsigned MDCL0              : 1;
    unsigned MDCL1              : 1;
    unsigned MDCL2              : 1;
    unsigned MDCL3              : 1;
    unsigned                    : 1;
    unsigned MDCLSYNC           : 1;
    unsigned MDCLPOL            : 1;
    unsigned MDCLODIS           : 1;
    };

  struct
    {
    unsigned MDCL               : 4;
    unsigned                    : 4;
    };
  } __MDCARLbits_t;

extern __at(0x0EEC) volatile __MDCARLbits_t MDCARLbits;

#define _MDCL0                  0x01
#define _MDCL1                  0x02
#define _MDCL2                  0x04
#define _MDCL3                  0x08
#define _MDCLSYNC               0x20
#define _MDCLPOL                0x40
#define _MDCLODIS               0x80

//==============================================================================


//==============================================================================
//        MDCARH Bits

extern __at(0x0EED) __sfr MDCARH;

typedef union
  {
  struct
    {
    unsigned MDCH0              : 1;
    unsigned MDCH1              : 1;
    unsigned MDCH2              : 1;
    unsigned MDCH3              : 1;
    unsigned                    : 1;
    unsigned MDCHSYNC           : 1;
    unsigned MDCHPOL            : 1;
    unsigned MDCHODIS           : 1;
    };

  struct
    {
    unsigned MDCH               : 4;
    unsigned                    : 4;
    };
  } __MDCARHbits_t;

extern __at(0x0EED) volatile __MDCARHbits_t MDCARHbits;

#define _MDCH0                  0x01
#define _MDCH1                  0x02
#define _MDCH2                  0x04
#define _MDCH3                  0x08
#define _MDCHSYNC               0x20
#define _MDCHPOL                0x40
#define _MDCHODIS               0x80

//==============================================================================


//==============================================================================
//        MDSRC Bits

extern __at(0x0EEE) __sfr MDSRC;

typedef union
  {
  struct
    {
    unsigned MDSRC0             : 1;
    unsigned MDSRC1             : 1;
    unsigned MDSRC2             : 1;
    unsigned MDSRC3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MDSODIS            : 1;
    };

  struct
    {
    unsigned MDSRC              : 4;
    unsigned                    : 4;
    };
  } __MDSRCbits_t;

extern __at(0x0EEE) volatile __MDSRCbits_t MDSRCbits;

#define _MDSRC0                 0x01
#define _MDSRC1                 0x02
#define _MDSRC2                 0x04
#define _MDSRC3                 0x08
#define _MDSODIS                0x80

//==============================================================================


//==============================================================================
//        MDCON Bits

extern __at(0x0EEF) __sfr MDCON;

typedef struct
  {
  unsigned MDBIT                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned MDO                  : 1;
  unsigned MDOPOL               : 1;
  unsigned MDSLR                : 1;
  unsigned MDOE                 : 1;
  unsigned MDEN                 : 1;
  } __MDCONbits_t;

extern __at(0x0EEF) volatile __MDCONbits_t MDCONbits;

#define _MDBIT                  0x01
#define _MDO                    0x08
#define _MDOPOL                 0x10
#define _MDSLR                  0x20
#define _MDOE                   0x40
#define _MDEN                   0x80

//==============================================================================


//==============================================================================
//        PMD4 Bits

